In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [5]:
To=[]
for i in df.From_To:
    To.append(i.split('_')[1])
    df.From_To.replace(i,i.split('_')[0],inplace=True)     #Splitting and replacing
df.rename(columns={'From_To':'From'},inplace=True)
df.insert(1,'To',To,True)  #Adding new column 
for city in df.From:
    df.From.replace(city,city.title(),inplace=True)  #Capitilizing the fist letter
for city in df.To:
    df.To.replace(city,city.title(),inplace=True)    #Capitilizing the first letter
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan           NaN            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris           NaN          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

In [6]:
df.FlightNumber.interpolate(method='linear',inplace=True,)   #Filling NAN values
df['FlightNumber']=df['FlightNumber'].apply(np.int64)        #Changing datatype to int64
df.dtypes

From            object
To              object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [7]:
#Creating new delay columns named as delay_1,delay_2 so on and adding values correspondingly or adding NAN

delay_1=[]
delay_2=[]
delay_3=[]
for i in df.RecentDelays:
    try:
        delay_1.append(i[0])
    except:
        delay_1.append(None)
    try:
        delay_2.append(i[1])
    except:
        delay_2.append(None)
    try:
        delay_3.append(i[2])
    except:
        delay_3.append(None)
df.drop(columns=['RecentDelays'],inplace=True) 
df.insert(3,'delay_1',delay_1,True)
df.insert(4,'delay_2',delay_2,True)
df.insert(5,'delay_3',delay_3,True)

In [8]:
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,"""Swiss Air"""